app/controllers/messages_controller.rb

  def destroy
    @message.destroy
---
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 2]]

  def update
    if @message.update(message_params)
---
UPDATE "messages" SET "body" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["body", "銀河超特急a"], ["updated_at", "2015-07-04 03:58:30.360861"], ["id", 4]]

  def index
    # Messageをすべて取得する
    @messages = Message.all
---
SELECT "messages".* FROM "messages"

  def create
    @message = Message.new(message_params)
    if @message.save
      redirect_to root_path, notice: 'メッセージを保存しました'
    else
      # メッセージが保存できなかった時
      @messages = Message.all
---
INSERT INTO "messages" ("name", "body", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "mentor-ito"], ["body", "test"], ["age", 31], ["created_at", "2015-07-13 06:27:27.394156"], ["updated_at", "2015-07-13 06:27:27.394156"]]
SELECT "messages".* FROM "messages"